[INFO] 2019-10-29 17:23:55 Inicio del proceso TFGVOP_CNN_1.py
[INFO] 2019-10-29 17:23:55 Leyendo archivo de configuración...
[INFO] 2019-10-29 17:23:55 Inicio del proceso TFGVOP_load_dataset.py
[INFO] 2019-10-29 17:23:55 Leyendo archivo de configuración...
[INFO] 2019-10-29 17:23:55 Llamada al proceso TFGVOP_load_dataset 
[INFO] 2019-10-29 17:23:55 Procesando el directorio...  Healthy
[INFO] 2019-10-29 17:23:56 Total imágenes del directorio ...  Healthy 50
[INFO] 2019-10-29 17:23:56 Procesando el directorio...  Leaf_blight
[INFO] 2019-10-29 17:23:56 Total imágenes del directorio ...  Leaf_blight 50
[INFO] 2019-10-29 17:23:56 Procesando el directorio...  Blackrot
[INFO] 2019-10-29 17:23:56 Total imágenes del directorio ...  Blackrot 50
[INFO] 2019-10-29 17:23:56 Procesando el directorio...  Esca
[INFO] 2019-10-29 17:23:56 Total imágenes del directorio ...  Esca 50
[INFO] 2019-10-29 17:23:56 Proceso de carga de imágenes completado 
[INFO] 2019-10-29 17:23:56 Total Etiquetas...  4
[INFO] 2019-10-29 17:23:56 Fin del proceso TFGVOP_load_dataset.py
[INFO] 2019-10-29 17:23:56 Imágenes cargadas. Número total de imágenes para procesar:   200 . Número total de clases diferentes: 4
[INFO] 2019-10-29 17:23:56 Dividiendo datos en train y test...
[INFO] 2019-10-29 17:23:56 Training data shape (x_train):  (180, 256, 256, 3)
[INFO] 2019-10-29 17:23:56 Training data shape (y_train):  (180,)
[INFO] 2019-10-29 17:23:56 Testing data shape (x_test):  (20, 256, 256, 3)
[INFO] 2019-10-29 17:23:56 Testing data shape (y_test):  (20,)
[INFO] 2019-10-29 17:23:56 Dividiendo datos en train y valid...
[INFO] 2019-10-29 17:23:56 Training data shape (x_train):  (144, 256, 256, 3)
[INFO] 2019-10-29 17:23:56 Training data shape (train_label):  (144, 4)
[INFO] 2019-10-29 17:23:56 Validating data shape (x_valid):  (36, 256, 256, 3)
[INFO] 2019-10-29 17:23:56 Validating data shape (valid_label):  (36, 4)
[INFO] 2019-10-29 17:23:56 Generado log en...  /Users/vmoctavio/Downloads/keras-tutorial/logs/pruebavidcon/borrar/CNN_1_20191029-172356
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 256, 256, 32)      896       
_________________________________________________________________
activation (Activation)      (None, 256, 256, 32)      0         
_________________________________________________________________
batch_normalization (BatchNo (None, 256, 256, 32)      128       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 85, 85, 32)        0         
_________________________________________________________________
dropout (Dropout)            (None, 85, 85, 32)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 85, 85, 64)        18496     
_________________________________________________________________
activation_1 (Activation)    (None, 85, 85, 64)        0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 85, 85, 64)        256       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 85, 85, 64)        36928     
_________________________________________________________________
activation_2 (Activation)    (None, 85, 85, 64)        0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 85, 85, 64)        256       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 42, 42, 64)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 42, 42, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 42, 42, 128)       73856     
_________________________________________________________________
activation_3 (Activation)    (None, 42, 42, 128)       0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 42, 42, 128)       512       
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 42, 42, 128)       147584    
_________________________________________________________________
activation_4 (Activation)    (None, 42, 42, 128)       0         
_________________________________________________________________
batch_normalization_4 (Batch (None, 42, 42, 128)       512       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 21, 21, 128)       0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 21, 21, 128)       0         
_________________________________________________________________
flatten (Flatten)            (None, 56448)             0         
_________________________________________________________________
dense (Dense)                (None, 1024)              57803776  
_________________________________________________________________
activation_5 (Activation)    (None, 1024)              0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 1024)              4096      
_________________________________________________________________
dropout_3 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 4)                 4100      
_________________________________________________________________
activation_6 (Activation)    (None, 4)                 0         
=================================================================
Total params: 58,091,396
Trainable params: 58,088,516
Non-trainable params: 2,880
_________________________________________________________________
Failed to import pydot. You must install pydot and graphviz for `pydotprint` to work.
Train on 144 samples, validate on 36 samples
Epoch 1/5
 32/144 [=====>........................] - ETA: 16s - loss: 2.5660 - acc: 0.3125 - mse: 0.2691 64/144 [============>.................] - ETA: 8s - loss: 2.4052 - acc: 0.2812 - mse: 0.2619  96/144 [===================>..........] - ETA: 4s - loss: 2.5415 - acc: 0.2708 - mse: 0.2715128/144 [=========================>....] - ETA: 1s - loss: 2.5566 - acc: 0.2734 - mse: 0.2729144/144 [==============================] - 39s 271ms/sample - loss: 2.4893 - acc: 0.2986 - mse: 0.2655 - val_loss: 1.4076 - val_acc: 0.2222 - val_mse: 0.1901
Epoch 2/5
 32/144 [=====>........................] - ETA: 9s - loss: 1.7087 - acc: 0.3750 - mse: 0.2064 64/144 [============>.................] - ETA: 5s - loss: 1.8473 - acc: 0.3906 - mse: 0.2119 96/144 [===================>..........] - ETA: 3s - loss: 1.6998 - acc: 0.4167 - mse: 0.2018128/144 [=========================>....] - ETA: 1s - loss: 1.5136 - acc: 0.4688 - mse: 0.1799144/144 [==============================] - 36s 252ms/sample - loss: 1.5384 - acc: 0.4514 - mse: 0.1848 - val_loss: 1.4426 - val_acc: 0.2222 - val_mse: 0.1937
Epoch 3/5
 32/144 [=====>........................] - ETA: 6s - loss: 1.5081 - acc: 0.4688 - mse: 0.1817 64/144 [============>.................] - ETA: 5s - loss: 1.3061 - acc: 0.4844 - mse: 0.1670 96/144 [===================>..........] - ETA: 3s - loss: 1.3728 - acc: 0.4792 - mse: 0.1709128/144 [=========================>....] - ETA: 1s - loss: 1.2551 - acc: 0.5234 - mse: 0.1576144/144 [==============================] - 36s 250ms/sample - loss: 1.2753 - acc: 0.5139 - mse: 0.1621 - val_loss: 1.5195 - val_acc: 0.2500 - val_mse: 0.2010
Epoch 4/5
 32/144 [=====>........................] - ETA: 7s - loss: 0.8528 - acc: 0.6875 - mse: 0.1251 64/144 [============>.................] - ETA: 5s - loss: 0.9371 - acc: 0.6250 - mse: 0.1367 96/144 [===================>..........] - ETA: 3s - loss: 1.0020 - acc: 0.6146 - mse: 0.1403128/144 [=========================>....] - ETA: 0s - loss: 0.9792 - acc: 0.6172 - mse: 0.1383144/144 [==============================] - 36s 248ms/sample - loss: 0.9168 - acc: 0.6458 - mse: 0.1301 - val_loss: 1.6334 - val_acc: 0.2500 - val_mse: 0.2119
Epoch 5/5
 32/144 [=====>........................] - ETA: 6s - loss: 1.3003 - acc: 0.6250 - mse: 0.1477 64/144 [============>.................] - ETA: 4s - loss: 1.0545 - acc: 0.6719 - mse: 0.1223 96/144 [===================>..........] - ETA: 2s - loss: 1.0833 - acc: 0.6354 - mse: 0.1303128/144 [=========================>....] - ETA: 0s - loss: 1.0117 - acc: 0.6562 - mse: 0.1220144/144 [==============================] - 36s 251ms/sample - loss: 1.0041 - acc: 0.6597 - mse: 0.1221 - val_loss: 1.7706 - val_acc: 0.2500 - val_mse: 0.2256
[INFO] 2019-10-29 17:27:06 Calculando la precisión del modelo CNN_1... 
20/1 [========================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================] - 0s 22ms/sample - loss: 1.9855 - acc: 0.1500 - mse: 0.2505
[INFO] 2019-10-29 17:27:06 Test Accuracy CNN_1: 15.000000596046448
[INFO] 2019-10-29 17:27:06 Test Loss CNN_1: 198.55178594589233
[INFO] 2019-10-29 17:27:07 Se han encontrado 3 etiquetas correctas
[INFO] 2019-10-29 17:27:10 Se han encontrado 17 etiquetas incorrectas
[INFO] 2019-10-29 17:27:13 Creando la matriz de confusión CNN_1...
[INFO] 2019-10-29 17:27:13 Visualizando la matriz de confusión...
[INFO] 2019-10-29 17:27:19 Informe de clasificación
              precision    recall  f1-score   support

     Healthy       0.15      1.00      0.26         3
 Leaf_blight       0.00      0.00      0.00         7
    Blackrot       0.00      0.00      0.00         2
        Esca       0.00      0.00      0.00         8

    accuracy                           0.15        20
   macro avg       0.04      0.25      0.07        20
weighted avg       0.02      0.15      0.04        20

[INFO] 2019-10-29 17:27:19 Llamada al proceso TFGVOP_save_model 
[INFO] 2019-10-29 17:27:19 Inicio del proceso TFGVOP_save_model.py
[INFO] 2019-10-29 17:27:19 Modelo correctamente guardado...  CNN_1
[INFO] 2019-10-29 17:27:19 Fin del proceso TFGVOP_save_model.py
[INFO] 2019-10-29 17:27:19 Fin del proceso TFGVOP_CNN_1.py
