[INFO] 2019-10-28 17:47:40 Inicio del proceso TFGVOP_vgg16.py
[INFO] 2019-10-28 17:47:40 Leyendo archivo de configuración...
[INFO] 2019-10-28 17:47:40 Inicio del proceso TFGVOP_load_dataset.py
[INFO] 2019-10-28 17:47:40 Leyendo archivo de configuración...
[INFO] 2019-10-28 17:47:40 Llamada al proceso TFGVOP_load_dataset 
[INFO] 2019-10-28 17:47:40 Procesando el directorio...  Healthy
[INFO] 2019-10-28 17:47:40 Total imágenes del directorio ...  Healthy 100
[INFO] 2019-10-28 17:47:40 Procesando el directorio...  Leaf_blight
[INFO] 2019-10-28 17:47:41 Total imágenes del directorio ...  Leaf_blight 100
[INFO] 2019-10-28 17:47:41 Procesando el directorio...  Blackrot
[INFO] 2019-10-28 17:47:41 Total imágenes del directorio ...  Blackrot 100
[INFO] 2019-10-28 17:47:41 Procesando el directorio...  Esca
[INFO] 2019-10-28 17:47:42 Total imágenes del directorio ...  Esca 100
[INFO] 2019-10-28 17:47:42 Proceso de carga de imágenes completado 
[INFO] 2019-10-28 17:47:42 Total Etiquetas...  4
[INFO] 2019-10-28 17:47:42 Fin del proceso TFGVOP_load_dataset.py
[INFO] 2019-10-28 17:47:42 Imágenes cargadas. Número total de imágenes para procesar:   400 . Número total de clases diferentes: 4
[INFO] 2019-10-28 17:47:42 Dividiendo datos en train y test...
[INFO] 2019-10-28 17:47:42 Training data shape (x_train):  (360, 256, 256, 3)
[INFO] 2019-10-28 17:47:42 Training data shape (y_train):  (360,)
[INFO] 2019-10-28 17:47:42 Testing data shape (x_test):  (40, 256, 256, 3)
[INFO] 2019-10-28 17:47:42 Testing data shape (y_test):  (40,)
[INFO] 2019-10-28 17:47:42 Dividiendo datos en train y valid...
[INFO] 2019-10-28 17:47:43 Training data shape (x_train):  (288, 256, 256, 3)
[INFO] 2019-10-28 17:47:43 Training data shape (train_label):  (288, 4)
[INFO] 2019-10-28 17:47:43 Validating data shape (x_valid):  (72, 256, 256, 3)
[INFO] 2019-10-28 17:47:43 Validating data shape (valid_label):  (72, 4)
[INFO] 2019-10-28 17:47:43 Generado log en...  /Users/vmoctavio/Downloads/keras-tutorial/logs/pruebavidcon/borrar/vgg16_20191028-174743
Model: "vgg16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 256, 256, 3)]     0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 256, 256, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 256, 256, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 128, 128, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 128, 128, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 128, 128, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 64, 64, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 64, 64, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 64, 64, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 64, 64, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 32, 32, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 32, 32, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 32, 32, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 32, 32, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 16, 16, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 16, 16, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 16, 16, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 16, 16, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 8, 8, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 32768)             0         
_________________________________________________________________
fc1 (Dense)                  (None, 4096)              134221824 
_________________________________________________________________
fc2 (Dense)                  (None, 4096)              16781312  
_________________________________________________________________
predictions (Dense)          (None, 4)                 16388     
=================================================================
Total params: 165,734,212
Trainable params: 165,734,212
Non-trainable params: 0
_________________________________________________________________
Train on 288 samples, validate on 72 samples
Epoch 1/10
 32/288 [==>...........................] - ETA: 3:34 - loss: 1.3864 - acc: 0.2500 - mse: 0.1875 64/288 [=====>........................] - ETA: 2:51 - loss: 1.3859 - acc: 0.2812 - mse: 0.1875