[INFO] 2019-10-22 12:10:53 Inicio del proceso TFGVOP_vgg19.py
[INFO] 2019-10-22 12:10:53 Leyendo archivo de configuración...
[INFO] 2019-10-22 12:10:53 Inicio del proceso TFGVOP_load_dataset.py
[INFO] 2019-10-22 12:10:53 Leyendo archivo de configuración...
[INFO] 2019-10-22 12:10:53 Llamada al proceso TFGVOP_load_dataset 
[INFO] 2019-10-22 12:10:53 Procesando el directorio...  Healthy
[INFO] 2019-10-22 12:10:53 Total imágenes del directorio ...  Healthy 100
[INFO] 2019-10-22 12:10:53 Procesando el directorio...  Leaf_blight
[INFO] 2019-10-22 12:10:54 Total imágenes del directorio ...  Leaf_blight 100
[INFO] 2019-10-22 12:10:54 Procesando el directorio...  Blackrot
[INFO] 2019-10-22 12:10:54 Total imágenes del directorio ...  Blackrot 100
[INFO] 2019-10-22 12:10:54 Procesando el directorio...  Esca
[INFO] 2019-10-22 12:10:54 Total imágenes del directorio ...  Esca 100
[INFO] 2019-10-22 12:10:54 Proceso de carga de imágenes completado 
[INFO] 2019-10-22 12:10:54 Total Etiquetas...  4
[INFO] 2019-10-22 12:10:54 Fin del proceso TFGVOP_load_dataset.py
[INFO] 2019-10-22 12:10:54 Imágenes cargadas. Número total de imágenes para procesar:   400 . Número total de clases diferentes: 4
[INFO] 2019-10-22 12:10:55 Dividiendo datos en train y test...
[INFO] 2019-10-22 12:10:55 Training data shape (x_train):  (360, 256, 256, 3)
[INFO] 2019-10-22 12:10:55 Training data shape (y_train):  (360,)
[INFO] 2019-10-22 12:10:55 Testing data shape (x_test):  (40, 256, 256, 3)
[INFO] 2019-10-22 12:10:55 Testing data shape (y_test):  (40,)
[INFO] 2019-10-22 12:10:55 Dividiendo datos en train y valid...
[INFO] 2019-10-22 12:10:55 Training data shape (x_train):  (288, 256, 256, 3)
[INFO] 2019-10-22 12:10:55 Training data shape (train_label):  (288, 4)
[INFO] 2019-10-22 12:10:55 Validating data shape (x_valid):  (72, 256, 256, 3)
[INFO] 2019-10-22 12:10:55 Validating data shape (valid_label):  (72, 4)
[INFO] 2019-10-22 12:10:55 Generado log en...  /Users/vmoctavio/Downloads/keras-tutorial/logs/pruebavidcon/borrar/vgg19_20191022-121055
Model: "vgg19"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 256, 256, 3)]     0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 256, 256, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 256, 256, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 128, 128, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 128, 128, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 128, 128, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 64, 64, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 64, 64, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 64, 64, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 64, 64, 256)       590080    
_________________________________________________________________
block3_conv4 (Conv2D)        (None, 64, 64, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 32, 32, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 32, 32, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 32, 32, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 32, 32, 512)       2359808   
_________________________________________________________________
block4_conv4 (Conv2D)        (None, 32, 32, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 16, 16, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 16, 16, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 16, 16, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 16, 16, 512)       2359808   
_________________________________________________________________
block5_conv4 (Conv2D)        (None, 16, 16, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 8, 8, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 32768)             0         
_________________________________________________________________
fc1 (Dense)                  (None, 4096)              134221824 
_________________________________________________________________
fc2 (Dense)                  (None, 4096)              16781312  
_________________________________________________________________
predictions (Dense)          (None, 4)                 16388     
=================================================================
Total params: 171,043,908
Trainable params: 171,043,908
Non-trainable params: 0
_________________________________________________________________
Train on 288 samples, validate on 72 samples
Epoch 1/10
 32/288 [==>...........................] - ETA: 3:01 - loss: 1.3863 - acc: 0.3125 - mse: 0.1875 64/288 [=====>........................] - ETA: 2:37 - loss: 1.3862 - acc: 0.2812 - mse: 0.1875 96/288 [=========>....................] - ETA: 2:14 - loss: 1.3864 - acc: 0.2500 - mse: 0.1875128/288 [============>.................] - ETA: 1:50 - loss: 1.3863 - acc: 0.2109 - mse: 0.1875160/288 [===============>..............] - ETA: 1:28 - loss: 1.3862 - acc: 0.2375 - mse: 0.1875192/288 [===================>..........] - ETA: 1:06 - loss: 1.3864 - acc: 0.2135 - mse: 0.1875224/288 [======================>.......] - ETA: 44s - loss: 1.3864 - acc: 0.2143 - mse: 0.1875 256/288 [=========================>....] - ETA: 22s - loss: 1.3865 - acc: 0.2148 - mse: 0.1875288/288 [==============================] - 232s 806ms/sample - loss: 1.3864 - acc: 0.2257 - mse: 0.1875 - val_loss: 1.3866 - val_acc: 0.1944 - val_mse: 0.1875
Epoch 2/10
 32/288 [==>...........................] - ETA: 3:10 - loss: 1.3864 - acc: 0.1562 - mse: 0.1875 64/288 [=====>........................] - ETA: 2:39 - loss: 1.3862 - acc: 0.2031 - mse: 0.1875 96/288 [=========>....................] - ETA: 2:14 - loss: 1.3862 - acc: 0.2083 - mse: 0.1875128/288 [============>.................] - ETA: 1:51 - loss: 1.3862 - acc: 0.2500 - mse: 0.1875160/288 [===============>..............] - ETA: 1:29 - loss: 1.3861 - acc: 0.2625 - mse: 0.1875192/288 [===================>..........] - ETA: 1:06 - loss: 1.3860 - acc: 0.2812 - mse: 0.1875224/288 [======================>.......] - ETA: 44s - loss: 1.3860 - acc: 0.2857 - mse: 0.1875 256/288 [=========================>....] - ETA: 22s - loss: 1.3859 - acc: 0.2852 - mse: 0.1875288/288 [==============================] - 230s 797ms/sample - loss: 1.3860 - acc: 0.2812 - mse: 0.1875 - val_loss: 1.3872 - val_acc: 0.1944 - val_mse: 0.1876
Epoch 3/10
 32/288 [==>...........................] - ETA: 3:12 - loss: 1.3859 - acc: 0.2500 - mse: 0.1874 64/288 [=====>........................] - ETA: 2:52 - loss: 1.3859 - acc: 0.2500 - mse: 0.1875 96/288 [=========>....................] - ETA: 2:25 - loss: 1.3857 - acc: 0.2500 - mse: 0.1874128/288 [============>.................] - ETA: 1:59 - loss: 1.3854 - acc: 0.2734 - mse: 0.1874160/288 [===============>..............] - ETA: 1:37 - loss: 1.3854 - acc: 0.2750 - mse: 0.1874192/288 [===================>..........] - ETA: 1:12 - loss: 1.3853 - acc: 0.2656 - mse: 0.1874224/288 [======================>.......] - ETA: 48s - loss: 1.3853 - acc: 0.2679 - mse: 0.1874 256/288 [=========================>....] - ETA: 24s - loss: 1.3851 - acc: 0.2734 - mse: 0.1873288/288 [==============================] - 249s 866ms/sample - loss: 1.3854 - acc: 0.2674 - mse: 0.1874 - val_loss: 1.3890 - val_acc: 0.1944 - val_mse: 0.1878
Epoch 4/10
 32/288 [==>...........................] - ETA: 2:36 - loss: 1.3882 - acc: 0.2188 - mse: 0.1877 64/288 [=====>........................] - ETA: 2:23 - loss: 1.3854 - acc: 0.2344 - mse: 0.1874 96/288 [=========>....................] - ETA: 2:14 - loss: 1.3831 - acc: 0.2812 - mse: 0.1871128/288 [============>.................] - ETA: 1:54 - loss: 1.3850 - acc: 0.2422 - mse: 0.1873160/288 [===============>..............] - ETA: 1:32 - loss: 1.3847 - acc: 0.2500 - mse: 0.1873192/288 [===================>..........] - ETA: 1:09 - loss: 1.3833 - acc: 0.2760 - mse: 0.1871224/288 [======================>.......] - ETA: 45s - loss: 1.3844 - acc: 0.2545 - mse: 0.1873 256/288 [=========================>....] - ETA: 22s - loss: 1.3831 - acc: 0.2656 - mse: 0.1871288/288 [==============================] - 233s 809ms/sample - loss: 1.3827 - acc: 0.2674 - mse: 0.1870 - val_loss: 1.3902 - val_acc: 0.1944 - val_mse: 0.1880
Epoch 5/10
 32/288 [==>...........................] - ETA: 2:40 - loss: 1.3785 - acc: 0.2500 - mse: 0.1865 64/288 [=====>........................] - ETA: 2:23 - loss: 1.3833 - acc: 0.2500 - mse: 0.1871 96/288 [=========>....................] - ETA: 2:04 - loss: 1.3844 - acc: 0.2188 - mse: 0.1872128/288 [============>.................] - ETA: 1:44 - loss: 1.3828 - acc: 0.2422 - mse: 0.1870160/288 [===============>..............] - ETA: 1:23 - loss: 1.3808 - acc: 0.2500 - mse: 0.1868192/288 [===================>..........] - ETA: 1:02 - loss: 1.3784 - acc: 0.2656 - mse: 0.1865224/288 [======================>.......] - ETA: 41s - loss: 1.3781 - acc: 0.2679 - mse: 0.1864 256/288 [=========================>....] - ETA: 21s - loss: 1.3769 - acc: 0.2656 - mse: 0.1863288/288 [==============================] - 218s 758ms/sample - loss: 1.3750 - acc: 0.2674 - mse: 0.1860 - val_loss: 1.3954 - val_acc: 0.1944 - val_mse: 0.1884
Epoch 6/10
 32/288 [==>...........................] - ETA: 2:54 - loss: 1.3559 - acc: 0.3125 - mse: 0.1832 64/288 [=====>........................] - ETA: 2:30 - loss: 1.3721 - acc: 0.2500 - mse: 0.1854 96/288 [=========>....................] - ETA: 2:08 - loss: 1.3597 - acc: 0.2812 - mse: 0.1837128/288 [============>.................] - ETA: 1:46 - loss: 1.3611 - acc: 0.2500 - mse: 0.1839160/288 [===============>..............] - ETA: 1:25 - loss: 1.3698 - acc: 0.2313 - mse: 0.1851192/288 [===================>..........] - ETA: 1:07 - loss: 1.3662 - acc: 0.2656 - mse: 0.1846224/288 [======================>.......] - ETA: 46s - loss: 1.3618 - acc: 0.2991 - mse: 0.1841 256/288 [=========================>....] - ETA: 22s - loss: 1.3595 - acc: 0.3008 - mse: 0.1837288/288 [==============================] - 236s 819ms/sample - loss: 1.3511 - acc: 0.3090 - mse: 0.1825 - val_loss: 1.3847 - val_acc: 0.1944 - val_mse: 0.1857
Epoch 7/10
 32/288 [==>...........................] - ETA: 2:38 - loss: 1.3971 - acc: 0.1875 - mse: 0.1884 64/288 [=====>........................] - ETA: 2:26 - loss: 1.3134 - acc: 0.2812 - mse: 0.1760 96/288 [=========>....................] - ETA: 2:08 - loss: 1.3184 - acc: 0.2812 - mse: 0.1766128/288 [============>.................] - ETA: 1:49 - loss: 1.3243 - acc: 0.2656 - mse: 0.1776160/288 [===============>..............] - ETA: 1:28 - loss: 1.3133 - acc: 0.2937 - mse: 0.1762192/288 [===================>..........] - ETA: 1:06 - loss: 1.3186 - acc: 0.3125 - mse: 0.1771224/288 [======================>.......] - ETA: 44s - loss: 1.3100 - acc: 0.3438 - mse: 0.1760 256/288 [=========================>....] - ETA: 22s - loss: 1.2982 - acc: 0.3672 - mse: 0.1744288/288 [==============================] - 228s 791ms/sample - loss: 1.2966 - acc: 0.3611 - mse: 0.1741 - val_loss: 1.3338 - val_acc: 0.2222 - val_mse: 0.1788
Epoch 8/10
 32/288 [==>...........................] - ETA: 2:40 - loss: 1.4050 - acc: 0.1875 - mse: 0.1893 64/288 [=====>........................] - ETA: 2:22 - loss: 1.2987 - acc: 0.2500 - mse: 0.1733 96/288 [=========>....................] - ETA: 2:03 - loss: 1.2771 - acc: 0.2917 - mse: 0.1705128/288 [============>.................] - ETA: 1:43 - loss: 1.2797 - acc: 0.2891 - mse: 0.1711160/288 [===============>..............] - ETA: 1:23 - loss: 1.2645 - acc: 0.3250 - mse: 0.1689192/288 [===================>..........] - ETA: 1:02 - loss: 1.2522 - acc: 0.3438 - mse: 0.1673224/288 [======================>.......] - ETA: 41s - loss: 1.2412 - acc: 0.3795 - mse: 0.1659 256/288 [=========================>....] - ETA: 20s - loss: 1.2263 - acc: 0.3906 - mse: 0.1639288/288 [==============================] - 218s 756ms/sample - loss: 1.2122 - acc: 0.4028 - mse: 0.1620 - val_loss: 1.2917 - val_acc: 0.3472 - val_mse: 0.1762
Epoch 9/10
 32/288 [==>...........................] - ETA: 2:52 - loss: 1.3945 - acc: 0.2812 - mse: 0.1905 64/288 [=====>........................] - ETA: 2:27 - loss: 1.1569 - acc: 0.4531 - mse: 0.1556 96/288 [=========>....................] - ETA: 2:06 - loss: 1.1666 - acc: 0.4583 - mse: 0.1571128/288 [============>.................] - ETA: 1:45 - loss: 1.1716 - acc: 0.4531 - mse: 0.1586160/288 [===============>..............] - ETA: 1:24 - loss: 1.1573 - acc: 0.4688 - mse: 0.1567192/288 [===================>..........] - ETA: 1:03 - loss: 1.1627 - acc: 0.4479 - mse: 0.1576224/288 [======================>.......] - ETA: 42s - loss: 1.1568 - acc: 0.4420 - mse: 0.1569 256/288 [=========================>....] - ETA: 21s - loss: 1.1259 - acc: 0.4609 - mse: 0.1522288/288 [==============================] - 219s 762ms/sample - loss: 1.1272 - acc: 0.4444 - mse: 0.1526 - val_loss: 1.2332 - val_acc: 0.3194 - val_mse: 0.1703
Epoch 10/10
 32/288 [==>...........................] - ETA: 2:50 - loss: 1.2843 - acc: 0.4688 - mse: 0.1749 64/288 [=====>........................] - ETA: 2:27 - loss: 1.1707 - acc: 0.4844 - mse: 0.1601 96/288 [=========>....................] - ETA: 2:08 - loss: 1.1993 - acc: 0.4583 - mse: 0.1629128/288 [============>.................] - ETA: 1:48 - loss: 1.1583 - acc: 0.4844 - mse: 0.1577160/288 [===============>..............] - ETA: 1:28 - loss: 1.1309 - acc: 0.4812 - mse: 0.1552192/288 [===================>..........] - ETA: 1:08 - loss: 1.1080 - acc: 0.4740 - mse: 0.1527224/288 [======================>.......] - ETA: 45s - loss: 1.1094 - acc: 0.4777 - mse: 0.1527 256/288 [=========================>....] - ETA: 22s - loss: 1.1249 - acc: 0.4883 - mse: 0.1532288/288 [==============================] - 237s 822ms/sample - loss: 1.1149 - acc: 0.4826 - mse: 0.1522 - val_loss: 1.0212 - val_acc: 0.4861 - val_mse: 0.1462
[INFO] 2019-10-22 12:49:25 Calculando la precisión del modelo vgg19... 
40/1 [================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================] - 7s 170ms/sample - loss: 1.4327 - acc: 0.5000 - mse: 0.1562
[INFO] 2019-10-22 12:49:31 Test Accuracy vgg19: 50.0
[INFO] 2019-10-22 12:49:31 Test Loss vgg19: 116.52591228485107
[INFO] 2019-10-22 12:49:39 Se han encontrado 20 etiquetas correctas
[INFO] 2019-10-22 12:49:43 Se han encontrado 20 etiquetas incorrectas
[INFO] 2019-10-22 12:49:44 Creando la matriz de confusión vgg19...
[INFO] 2019-10-22 12:49:44 Visualizando la matriz de confusión...
[INFO] 2019-10-22 12:49:47 Informe de clasificación
              precision    recall  f1-score   support

     Healthy       0.46      1.00      0.63        12
 Leaf_blight       0.83      0.56      0.67         9
    Blackrot       0.00      0.00      0.00        11
        Esca       0.38      0.38      0.38         8

    accuracy                           0.50        40
   macro avg       0.42      0.48      0.42        40
weighted avg       0.40      0.50      0.41        40

[INFO] 2019-10-22 12:49:47 Llamada al proceso TFGVOP_save_model 
[INFO] 2019-10-22 12:49:47 Inicio del proceso TFGVOP_save_model.py
[INFO] 2019-10-22 12:49:47 Modelo correctamente guardado...  vgg19
[INFO] 2019-10-22 12:49:47 Fin del proceso TFGVOP_save_model.py
[INFO] 2019-10-22 12:49:47 Fin del proceso TFGVOP_vgg19.py
