[INFO] 2019-10-13 14:06:56 Inicio del proceso TFGVOP_vgg19.py
[INFO] 2019-10-13 14:06:57 Inicio del proceso TFGVOP_load_dataset.py
[INFO] 2019-10-13 14:06:57 Llamada al proceso TFGVOP_load_dataset 
[INFO] 2019-10-13 14:06:57 Procesando el directorio...  Healthy
[INFO] 2019-10-13 14:06:57 Total imágenes del directorio ...  Healthy 50
[INFO] 2019-10-13 14:06:57 Procesando el directorio...  Leaf_blight
[INFO] 2019-10-13 14:06:57 Total imágenes del directorio ...  Leaf_blight 50
[INFO] 2019-10-13 14:06:57 Procesando el directorio...  Blackrot
[INFO] 2019-10-13 14:06:57 Total imágenes del directorio ...  Blackrot 50
[INFO] 2019-10-13 14:06:57 Procesando el directorio...  Esca
[INFO] 2019-10-13 14:06:58 Total imágenes del directorio ...  Esca 50
[INFO] 2019-10-13 14:06:58 Proceso de carga de imágenes completado 
[INFO] 2019-10-13 14:06:58 Total Etiquetas...  4
[INFO] 2019-10-13 14:06:58 Fin del proceso TFGVOP_load_dataset.py
[INFO] 2019-10-13 14:06:58 Imágenes cargadas. Número total de imágenes para procesar:   200 . Número total de clases diferentes: 4
[INFO] 2019-10-13 14:06:58 Dividiendo datos en train y test...
[INFO] 2019-10-13 14:06:58 Training data shape (x_train):  (180, 256, 256, 3)
[INFO] 2019-10-13 14:06:58 Training data shape (y_train):  (180,)
[INFO] 2019-10-13 14:06:58 Testing data shape (x_test):  (20, 256, 256, 3)
[INFO] 2019-10-13 14:06:58 Testing data shape (y_test):  (20,)
[INFO] 2019-10-13 14:06:58 Dividiendo datos en train y valid...
[INFO] 2019-10-13 14:06:58 Training data shape (x_train):  (144, 256, 256, 3)
[INFO] 2019-10-13 14:06:58 Training data shape (train_label):  (144, 4)
[INFO] 2019-10-13 14:06:58 Validating data shape (x_valid):  (36, 256, 256, 3)
[INFO] 2019-10-13 14:06:58 Validating data shape (valid_label):  (36, 4)
[INFO] 2019-10-13 14:06:58 Generado log en...  /Users/vmoctavio/Downloads/keras-tutorial/logs/pruebavidcon/borrar/vgg19_20191013-140658
Model: "vgg19"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 256, 256, 3)]     0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 256, 256, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 256, 256, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 128, 128, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 128, 128, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 128, 128, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 64, 64, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 64, 64, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 64, 64, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 64, 64, 256)       590080    
_________________________________________________________________
block3_conv4 (Conv2D)        (None, 64, 64, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 32, 32, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 32, 32, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 32, 32, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 32, 32, 512)       2359808   
_________________________________________________________________
block4_conv4 (Conv2D)        (None, 32, 32, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 16, 16, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 16, 16, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 16, 16, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 16, 16, 512)       2359808   
_________________________________________________________________
block5_conv4 (Conv2D)        (None, 16, 16, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 8, 8, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 32768)             0         
_________________________________________________________________
fc1 (Dense)                  (None, 4096)              134221824 
_________________________________________________________________
fc2 (Dense)                  (None, 4096)              16781312  
_________________________________________________________________
predictions (Dense)          (None, 4)                 16388     
=================================================================
Total params: 171,043,908
Trainable params: 171,043,908
Non-trainable params: 0
_________________________________________________________________
Train on 144 samples, validate on 36 samples
Epoch 1/5
 32/144 [=====>........................] - ETA: 1:25 - loss: 1.3863 - acc: 0.3125 - mse: 0.1875 64/144 [============>.................] - ETA: 58s - loss: 1.3864 - acc: 0.2500 - mse: 0.1875  96/144 [===================>..........] - ETA: 34s - loss: 1.3864 - acc: 0.2396 - mse: 0.1875128/144 [=========================>....] - ETA: 11s - loss: 1.3862 - acc: 0.2812 - mse: 0.1875144/144 [==============================] - 137s 949ms/sample - loss: 1.3864 - acc: 0.2500 - mse: 0.1875 - val_loss: 1.3866 - val_acc: 0.2500 - val_mse: 0.1875
Epoch 2/5
 32/144 [=====>........................] - ETA: 1:18 - loss: 1.3858 - acc: 0.4375 - mse: 0.1874 64/144 [============>.................] - ETA: 1:01 - loss: 1.3861 - acc: 0.4062 - mse: 0.1875 96/144 [===================>..........] - ETA: 38s - loss: 1.3860 - acc: 0.3958 - mse: 0.1875 128/144 [=========================>....] - ETA: 14s - loss: 1.3859 - acc: 0.3750 - mse: 0.1875144/144 [==============================] - 168s 1s/sample - loss: 1.3859 - acc: 0.3681 - mse: 0.1874 - val_loss: 1.3865 - val_acc: 0.2500 - val_mse: 0.1875
Epoch 3/5
 32/144 [=====>........................] - ETA: 1:16 - loss: 1.3857 - acc: 0.2812 - mse: 0.1874 64/144 [============>.................] - ETA: 58s - loss: 1.3859 - acc: 0.2656 - mse: 0.1874  96/144 [===================>..........] - ETA: 39s - loss: 1.3854 - acc: 0.3021 - mse: 0.1874128/144 [=========================>....] - ETA: 13s - loss: 1.3857 - acc: 0.2656 - mse: 0.1874144/144 [==============================] - 151s 1s/sample - loss: 1.3855 - acc: 0.2639 - mse: 0.1874 - val_loss: 1.3867 - val_acc: 0.2500 - val_mse: 0.1876
Epoch 4/5
 32/144 [=====>........................] - ETA: 1:23 - loss: 1.3861 - acc: 0.2812 - mse: 0.1875 64/144 [============>.................] - ETA: 1:08 - loss: 1.3852 - acc: 0.2656 - mse: 0.1874 96/144 [===================>..........] - ETA: 43s - loss: 1.3849 - acc: 0.2500 - mse: 0.1873 128/144 [=========================>....] - ETA: 14s - loss: 1.3840 - acc: 0.2812 - mse: 0.1872144/144 [==============================] - 159s 1s/sample - loss: 1.3847 - acc: 0.2639 - mse: 0.1873 - val_loss: 1.3877 - val_acc: 0.2500 - val_mse: 0.1877
Epoch 5/5
 32/144 [=====>........................] - ETA: 1:25 - loss: 1.3832 - acc: 0.2812 - mse: 0.1871 64/144 [============>.................] - ETA: 1:06 - loss: 1.3824 - acc: 0.3281 - mse: 0.1870 96/144 [===================>..........] - ETA: 42s - loss: 1.3826 - acc: 0.3125 - mse: 0.1870 128/144 [=========================>....] - ETA: 14s - loss: 1.3829 - acc: 0.3047 - mse: 0.1871144/144 [==============================] - 160s 1s/sample - loss: 1.3828 - acc: 0.2847 - mse: 0.1871 - val_loss: 1.3902 - val_acc: 0.2500 - val_mse: 0.1880
[INFO] 2019-10-13 14:20:01 Calculando la precisión del modelo vgg19... 
20/1 [========================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================] - 4s 177ms/sample - loss: 1.4007 - acc: 0.1500 - mse: 0.1893
[INFO] 2019-10-13 14:20:05 Test Accuracy vgg19: 15.000000596046448
[INFO] 2019-10-13 14:20:05 Test Loss vgg19: 140.0693655014038
[INFO] 2019-10-13 14:20:09 Se han encontrado 3 etiquetas correctas
[INFO] 2019-10-13 14:20:12 Se han encontrado 17 etiquetas incorrectas
[INFO] 2019-10-13 14:20:14 Creando la matriz de confusión vgg19...
[INFO] 2019-10-13 14:20:14 Visualizando la matriz de confusión...
[INFO] 2019-10-13 14:20:16 Informe de clasificación
              precision    recall  f1-score   support

     Healthy       0.15      1.00      0.26         3
 Leaf_blight       0.00      0.00      0.00         7
    Blackrot       0.00      0.00      0.00         2
        Esca       0.00      0.00      0.00         8

    accuracy                           0.15        20
   macro avg       0.04      0.25      0.07        20
weighted avg       0.02      0.15      0.04        20

[INFO] 2019-10-13 14:20:16 Llamada al proceso TFGVOP_save_model 
[INFO] 2019-10-13 14:20:16 Inicio del proceso TFGVOP_save_model.py
[INFO] 2019-10-13 14:20:16 Modelo correcamente guardado...  vgg19
[INFO] 2019-10-13 14:20:16 Fin del proceso TFGVOP_save_model.py
[INFO] 2019-10-13 14:20:16 Fin del proceso TFGVOP_vgg19.py
